Revit 2024 API
PhotometricWebLightDistribution Properties
The PhotometricWebLightDistribution type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from LightDistribution.)
PhotometricWebFile
 The filename of an IES photometric web file.
TiltAngle
 The tilt angle.
See Also
PhotometricWebLightDistribution Class
Autodesk.Revit.DB.Lighting Namespace